# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"

# Brew CLI apps

brew "awscli"
brew "azure-cli"
brew "diff-so-fancy"
brew "direnv"
brew "gh"
brew "git-extras"
brew "gnupg"
brew "go"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "node"
brew "packer"
brew "pulumi"
brew "thefuck"
brew "tldr"
brew "tree"
brew "vim"
brew "wget"
brew "yadm"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "oh-my-posh"
brew "libgcrypt"
brew "maven"
brew "gradle"

# App casks
cask "1password"
cask "alfred"
cask "bartender"
cask "beyond-compare"
cask "cron"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "firefox"
cask "iterm2"
cask "keybase"
cask "moom"
cask "ngrok"
cask "notion"
cask "postman"
cask "signal"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
cask "google-chrome"
cask "loom"
cask "miro"
cask "drawio"
cask "readdle-spark"
cask "mimestream"
cask "docker"
cask "intellij-idea"

# Font casks
cask "font-fira-code-nerd-font"

# Mac App Store apps
mas "iMovie", id: 408981434
mas "Microsoft Remote Desktop", id: 1295203466